{
  "COMMON": {
    "CLOSE": "Cerrar"
  },
  "HEADER": {
    "SUBTITLE": "Ingeniero de Software y Desarrollador Full Stack"
  },
  "ABOUT": {
    "TITLE": "Sobre mí",
    "INTRO": "👋 ¡Hola! Soy Antonio Saborido Campos, tengo 23 años y me considero un apasionado de la Informática, recientemente he comenzado mi carrera profesional como Desarrollador Full Stack en Babel.",
    "EDUCATION": "🎓 Mi formación académica en Ingeniería Informática en la Universidad de Sevilla me ha proporcionado una base sólida en la resolución de problemas, la programación y la gestión de proyectos. También durante mi formación he tenido la oportunidad de aprender tecnologías como Python, Node, PowerBI, Java, JavaScript, HTML, Docker, CSS y Haskell entre otras.",
    "CURRENT_ROLE": "💼 Actualmente, tengo un contrato como Desarrollador Full Stack en Babel, donde aplico mis conocimientos en tecnologías como Angular CLI en el desarrollo de aplicaciones web tanto en el front end como en back end con Spring Tools.",
    "MOTIVATION": "💪 Mi determinación y entusiasmo por aprender y crecer en el campo de la informática me impulsan constantemente a buscar nuevas oportunidades y desafíos."
  },
  "EDUCATION": {
    "TITLE": "Educación",
    "TIMELINE": [
      {
        "DATE": "2024",
        "TITLE": "Certificación Scrum Master",
        "DESCRIPTION": "Certificado ScrumMaster® (CSM®) de Scrum Manager",
        "pdfUrl": "assets/pdfs/cert_scrum_master.pdf",
        "pdfName": "Certificación Scrum Master"
      },
      {
        "DATE": "2024",
        "TITLE": "Curso Java SE 17 Developer",
        "DESCRIPTION": "Curso Java para la cetificación Java SE 17 Developer 30 horas",
        "pdfUrl": "assets/pdfs/cursoJava.pdf",
        "pdfName": "Curso Java"
      },
      {
        "DATE": "2024",
        "TITLE": "Certificación Fundamentos ITIL",
        "DESCRIPTION": "Certificado de Fundamentos ITIL en Gestión de Servicios de TI por PeopleCert y Axelos",
        "pdfUrl": "assets/pdfs/itil.pdf",
        "pdfName": "Certificado ITIL"
      },
      {
        "DATE": "2024",
        "TITLE": "Curso Oracle, SQL y PL/SQL",
        "DESCRIPTION": "Curso de conceptos de lenguaje de programación SQL y PL/SQL. Escritura comandos SQL, desarrollo procedimientos PL/SQL almacenados, funciones, paquetes y disparadores de base de datos.",
        "pdfUrl": "assets/pdfs/oracle.pdf",
        "pdfName": "Certificado Oracle"
      },
      {
        "DATE": "2019 - 2024",
        "TITLE": "Ingeniería Informática",
        "DESCRIPTION": "Universidad de Sevilla - Grado en Ingeniería Informática - Tecnologías Informáticas en la rama de sistemas de información."
      },
      {
        "DATE": "2023",
        "TITLE": "Certificado de Nivel de Inglés C1",
        "DESCRIPTION": "Certificado de nivel C1 de inglés por el British Council.",
        "pdfUrl": "assets/pdfs/ingles-c1.pdf",
        "pdfName": "Certificado Inglés C1"
      },
      {
        "DATE": "2017 - 2019",
        "TITLE": "Bachillerato Científico-Tecnológico",
        "DESCRIPTION": "IES Sofía de Jerez de la Frontera."
      }
    ]
  },
  "EXPERIENCE": {
    "TITLE": "Experiencia",
    "TIMELINE":
      {
        "DATE": "Octubre 2023 - Actualidad",
        "TITLE": "Babel Group",
        "DESCRIPTION": "Software Engineer FullStack - Jornada completa en remoto"
      }

  },
  "COOKIES": {
    "FOOTER": "Política de cookies",
    "MESSAGE": "Este sitio utiliza cookies para mejorar la experiencia de usuario. ¿Aceptas nuestra política de cookies?",
    "DECLINE": "Rechazar",
    "ACCEPT": "Aceptar",
    "READ": "Leer la política de cookies"
  },
  "COOKIESPAGE": {
    "TITLE": "Política de cookies",
    "POLICY_DESC": "Esta es la política de cookies de nuestra aplicación, donde explicamos detalladamente cómo utilizamos las cookies para mejorar tu experiencia de usuario. Las cookies son pequeños archivos de texto que se almacenan en tu dispositivo para recordar tus preferencias y realizar un seguimiento de tu comportamiento de navegación, lo que nos permite ofrecerte una experiencia más personalizada y eficiente. Utilizamos tanto cookies propias como de terceros para recopilar datos analíticos, personalizar el contenido, y mejorar la funcionalidad de nuestro sitio. Al continuar navegando en nuestro sitio, aceptas el uso de estas cookies conforme a nuestra política.",    "PRIVACY_TITLE": "Política de Privacidad",
    "INTRODUCTION_TITLE": "Introducción",
    "INTRODUCTION_DESC": "En antoniosaborido.es, valoramos tu privacidad y nos comprometemos a proteger la información personal que compartes con nosotros. Esta Política de Privacidad describe cómo recopilamos, usamos y protegemos tu información personal cuando visitas nuestra página web.",
    "COLLECTION_TITLE": "Información que Recopilamos",
    "PERSONAL_INFO_DESC": "Información Personal: Podemos recopilar información personal que nos proporcionas voluntariamente, como tu nombre, dirección de correo electrónico, y cualquier otro dato que nos envíes a través de formularios de contacto o suscripciones a boletines.",
    "NON_PERSONAL_INFO_DESC": "Información No Personal: Podemos recopilar información no personal sobre tu visita a nuestra página web, como tu dirección IP, tipo de navegador, páginas visitadas, y tiempo de permanencia en nuestra web. Esta información se recopila de manera anónima y se utiliza para mejorar la experiencia del usuario.",
    "USAGE_TITLE": "Uso de la Información",
    "USAGE_DESC": "Utilizamos la información recopilada para los siguientes propósitos:",
    "COMMUNICATION": "Comunicación: Para responder a tus consultas, comentarios o solicitudes.",
    "WEBSITE_IMPROVEMENT": "Mejora del Sitio Web: Para analizar el uso de nuestra web y mejorar su funcionalidad y contenido.",
    "MARKETING": "Marketing: Para enviarte información sobre actualizaciones, promociones y noticias relacionadas con nuestro sitio web, siempre y cuando hayas dado tu consentimiento para recibir estas comunicaciones.",
    "COOKIES_TITLE": "Cookies",
    "COOKIES_DESC": "Utilizamos cookies para mejorar tu experiencia en nuestro sitio web. Las cookies son pequeños archivos de texto que se almacenan en tu dispositivo cuando visitas ciertas páginas web. Puedes desactivar las cookies cambiando la configuración de tu navegador, pero esto puede afectar la funcionalidad del sitio.",
    "SHARING_TITLE": "Compartir Información",
    "SHARING_DESC": "No vendemos, intercambiamos ni transferimos tu información personal a terceros. Sin embargo, podemos compartir tu información con proveedores de servicios de confianza que nos ayudan a operar nuestro sitio web, siempre que estas partes acuerden mantener esta información confidencial.",
    "SECURITY_TITLE": "Seguridad de la Información",
    "SECURITY_DESC": "Implementamos diversas medidas de seguridad para proteger tu información personal. Sin embargo, ten en cuenta que ningún método de transmisión por Internet o de almacenamiento electrónico es 100% seguro.",
    "LINKS_TITLE": "Enlaces a Otros Sitios Web",
    "LINKS_DESC": "Nuestra página web puede contener enlaces a otros sitios web de interés. Sin embargo, una vez que hayas utilizado estos enlaces para salir de nuestra web, no tenemos control sobre esos otros sitios. Por lo tanto, no podemos responsabilizarnos de la protección y privacidad de cualquier información que proporciones mientras visitas dichos sitios.",
    "RIGHTS_TITLE": "Tus Derechos",
    "RIGHTS_DESC": "Tienes derecho a acceder, rectificar o eliminar tu información personal que hemos recopilado. Si deseas ejercer estos derechos, por favor contáctanos a través de la información proporcionada en nuestro sitio web.",
    "PRIVACY_CHANGES_TITLE": "Cambios en la Política de Privacidad",
    "PRIVACY_CHANGES_DESC": "Podemos actualizar esta Política de Privacidad de vez en cuando. Te notificaremos sobre cualquier cambio publicando la nueva política en esta página. Te recomendamos revisar esta política periódicamente para estar al tanto de cualquier modificación."
  },
  "PROJECTS": {
    "TITLE": "Proyectos",
    "DEMO": "Demo",
    "LIST": [
      {
        "TITLE": "Jump Marius",
        "DESCRIPTION": "Juego de plataformas en 2D realizado con la librería de Python, Pygame.",
        "REPO_URL": "https://github.com/Antoniiosc7/JumpMarius",
        "LINKS": true,
        "IS_TFG": false
      },
      {
        "TITLE": "Jersey Detection",
        "DESCRIPTION": "Detección de texto en imágenes, principalmente basado en camisetas de futbol que detectan el jugador. Hecho en Python.",
        "REPO_URL": "https://github.com/Antoniiosc7/JerseyDetection",
        "LINKS": false,
        "IS_TFG": false
      },
      {
        "TITLE": "Twitch Clips",
        "DESCRIPTION": "Integración de la api de twitch en una página svelte que permite ver los clips más populares de los streamers de League of Legends. Realizado con Svelte.",
        "REPO_URL": "https://github.com/Antoniiosc7/TwitchClips",
        "LINKS": false,
        "IS_TFG": false
      },
      {
        "TITLE": "Api Tennis",
        "DESCRIPTION": "Este repositorio crea una API usando Javascript y Expressjs sobre estadísticas de tenis. Hecho en JavaScript",
        "REPO_URL": "https://github.com/Antoniiosc7/TFG-Server",
        "LINKS": false,
        "IS_TFG": false
      },
      {
        "TITLE": "Juego de la Serpiente",
        "DESCRIPTION": "Es una recreación del clásico juego de la serpiente que tiene que comer manzanas evitando chocarse tanto con los bordes como con los obstáculos intermedio. Hecho usando Haskell.",
        "REPO_URL": "https://github.com/Antoniiosc7/TFG-Server",
        "LINKS": false,
        "IS_TFG": false
      },
      {
        "TITLE": "<strong>TRABAJO FIN DE GRADO</strong> - Modelado y Prueba de TPAs en el marco de DORA",
        "DESCRIPTION": "He desarrollado un microservicio que se integra en el ecosistema de Bluejay para facilitar la creación de métricas.",
        "TFG_LINK": "/proyectos/tfg",
        "REPO_URL": "https://github.com/Antoniiosc7/tp-tester",
        "LINKS": true,
        "IS_TFG": true
      },
      {
        "TITLE": "Certificaciones",
        "DESCRIPTION": "He desarrollado una web que te permite estudiar y realizar examenes iguales que lo encontrarás en las certificaciones oficiales. Está realizada con Angular 18 en el front y Spring Boot para el backend.",
        "LINKS": true,
        "IS_TFG": false,
        "DEMO_URL": "https://certs.antoniosaborido.es/"
      },
      {
        "TITLE": "Juego de Plataformas 2D en Angular",
        "DESCRIPTION": " Desarrollo de un juego de plataformas en 2D donde el personaje avanza automáticamente, generando dinámicamente enemigos y obstáculos en posiciones aleatorias, utilizando Angular para la gestión de la lógica de movimiento y colisiones.",
        "LINKS": true,
        "IS_TFG": false,
        "REPO_URL": "https://github.com/Antoniiosc7/angular-plataformas",
        "DEMO_URL": "https://plataformas.antoniosaborido.es/"
      }
    ]
  },
  "NOTFOUND" : {
    "TITLE": "Página no encontrada",
    "DESCRIPTION": "Lo sentimos, la página que buscas no existe o ha sido movida.",
    "BACK": "Volver a la página de inicio"
  },
  "TFG": {
    "TITLE": "TRABAJO FIN DE GRADO - Modelado y Prueba de TPAs en el marco de DORA",
    "POPUP": "Ver Memoria",
    "REPOSITORY": "Ver Repositorio",
    "INTRO": "Introducción",
    "INTRO1": "Este Trabajo de Fin de Grado (TFG) se enfoca en el desarrollo de un sistema informático, aplicando buenas prácticas de desarrollo de software y metodologías ágiles. A lo largo del proyecto, se abordaron diversas fases, desde la planificación y análisis hasta la implementación y evaluación, con el objetivo de crear un sistema eficiente y adaptable.",
    "INTRO2": "El proyecto establece el contexto y los objetivos, tanto en términos técnicos como académicos. Los objetivos técnicos incluyen la creación de un sistema que mejore la eficiencia y calidad del desarrollo de software, mientras que los objetivos académicos se centran en la aplicación práctica de conocimientos teóricos adquiridos durante la carrera.",
    "INTRO3": "La metodología ágil fue adoptada para el desarrollo del proyecto, permitiendo una gestión flexible y dinámica a través de sprints. Se utilizaron herramientas como GitHub, TogglTrack, Google Calendar y Google Chat para una organización eficiente y un seguimiento detallado del progreso.",
    "INTRO4": "Se realizó una auditoría de las buenas prácticas del equipo, enfocándose en Bluejay y las TPAs (Team Performance Assessments), incluyendo una exploración de visualizaciones en Grafana y un manual para la creación de widgets personalizados.",
    "INTRO5": "El análisis del sistema define el objetivo y describe su arquitectura y diseño funcional, abordando tanto el frontend como el backend y proporcionando una visión completa de su diseño y funcionalidad.",
    "INTRO6": "La implementación del sistema se describe detalladamente, incluyendo el entorno de desarrollo y el stack tecnológico utilizado, así como detalles específicos de la implementación como las traducciones, la gestión de archivos locales y la ejecución de casos de prueba.",
    "INTRO7": "Se incluyen manuales para el despliegue y uso del sistema, ofreciendo instrucciones detalladas para el despliegue en modo desarrollo, producción y aplicación, así como una guía de referencia para el archivo de configuración y un tutorial sobre el ciclo de creación de un TPA.",
    "INTRO8": "El documento concluye con un análisis de los problemas encontrados durante el desarrollo y propone soluciones y trabajos futuros, destacando la importancia de las metodologías ágiles en el desarrollo de software y el valor de la aplicación práctica de conocimientos teóricos.",
    "INTRO9": "En resumen, se proporciona una visión detallada y estructurada del desarrollo de un proyecto de software, desde la introducción y la metodología hasta la implementación y los manuales de uso, concluyendo con un análisis de problemas y propuestas para futuros trabajos.",
    "RESEARCH": "Investigación de gráficas",
    "RESEARCH1": "Las visualizaciones del dashboard que utiliza Bluejay se hacen en grafana, para ello podríamos utilizar las visualizaciones básicas que incluye Grafana o utilizar visualizaciones externas. Para profundizar esto, se elaboró una investigación para conocer las gráficas que estaban disponible por defecto en grafana, las que necesitaban de un plugin externo o las que eran necesario crear este plugin externo.",
    "RESEARCH2": "Esta investigación arrojó los siguientes resultados:",
    "RESEARCH3": "Es decir, 1 de cada 3 gráficas tiene soporte nativo ya integrado en Grafana, el 28,33% requieren de algún plugin que ya ha sido creado y el 38% no tienen soporte nativo ni plugin creado, aunque sería sencillo crear un plugin que lo crease utiliazando librerías de gráficas como Highchart para ello.",
    "PROJECTSTRUCTURE": "Estructura del proyecto",
    "PROJECTSTRUCTURE1": "La aplicación se divide en dos partes principales: el frontend desarrollado en Angular y el backend en Express. Ambos están diseñados para ser modulares, escalables y mantener una estructura clara. Además, el frontend interactúa con la API propia (backend), con la API de GitHub y con la API de Bluejay, lo que permite una amplia gama de funcionalidades y una integración eficiente con servicios externos.",
    "PROJECTSTRUCTURE2": "Frontend",
    "PROJECTSTRUCTURE3": "Modelos: Definen la estructura de los datos para tipar respuestas y peticiones HTTP.",
    "PROJECTSTRUCTURE4": "Servicios: Encargados de la comunicación con el backend y APIs externas, incluyendo servicios para repositorios, TPAs, Bluejay y GitHub.",
    "PROJECTSTRUCTURE5": "Componentes: Bloques reutilizables de UI para funcionalidades específicas como gestión de TPAs, panel de métricas, integración con GitHub, y más.",
    "PROJECTSTRUCTURE6": "Páginas: Vistas completas que agrupan componentes para ofrecer funcionalidades principales como gestión de TPAs, visualización de métricas, y tests con GitHub.",
    "PROJECTSTRUCTURE7": "Backend",
    "PROJECTSTRUCTURE8": "Gestión de Repositorios: Incluye clonado, gestión de archivos y ejecución de scripts.",
    "PROJECTSTRUCTURE9": "Manejo de Métricas, Scripts y TPAs: Operaciones CRUD y gestión de TPAs.",
    "PROJECTSTRUCTURE10": "Documentación API: Utilización de Swagger para documentar la API, facilitando su uso y pruebas.",
    "PROJECTSTRUCTURE11": "Esta estructura permite una interacción eficiente entre el frontend y el backend, asegurando una gestión adecuada de métricas, TPAs y repositorios, además de facilitar la integración con APIs externas.",
    "PAGESSTRUCTURE": "Estructura de las páginas",
    "PAGESSTRUCTURE1": "Página de Inicio",
    "PAGESSTRUCTURE2": "Al iniciar TP-Tester, la página inicial es \"Home\". Esta página contiene una organización por secciones del contenido equivalente al archivo Readme del proyecto, describiendo el funcionamiento de cada página. En la parte izquierda, se puede navegar a todas las secciones disponibles de la documentación, y en la parte superior derecha, se puede seleccionar el idioma de visualización entre español e inglés.",
    "PAGESSTRUCTURE3": "Página Testear Métricas",
    "PAGESSTRUCTURE4": "Esta página está diseñada para gestionar y probar métricas, proporcionando una interfaz amigable para visualizar, crear y gestionar métricas. Se accede desde cualquier página haciendo clic en “Metrics”.",
    "PAGESSTRUCTURE5": "Estructura de la Página",
    "PAGESSTRUCTURE6": "La página muestra todas las métricas guardadas en dos grandes tablas: una para métricas relacionadas con el TPA y otra para métricas individuales no relacionadas con ningún TPA específico. Cada fila de la tabla incluye el nombre de la métrica y botones para ver, ejecutar/editar, y eliminar la métrica. Además, hay una sección para crear nuevas métricas introduciendo el contenido en un área de texto y guardándolas como JSON.",
    "PAGESSTRUCTURE7": "Testeo Manual",
    "PAGESSTRUCTURE8": "Esta página permite clonar nuevos repositorios o trabajar con repositorios ya clonados. Al entrar, se pueden ver todos los repositorios accesibles mediante un token, y cada repositorio tiene botones para ver detalles y editar.",
    "PAGESSTRUCTURE9": "Clonar Nuevos Repositorios",
    "PAGESSTRUCTURE10": "Se pueden ver los repositorios accesibles con el token introducido, mostrando detalles del repositorio y permitiendo clonar el repositorio para realizar acciones sobre él en la pantalla de repositorios clonados.",
    "PAGESSTRUCTURE11": "Repositorios Clonados",
    "PAGESSTRUCTURE12": "Permite trabajar con repositorios clonados previamente, proporcionando una descripción breve y un botón para comenzar a trabajar con el repositorio clonado. Incluye opciones para gestionar ramas (ver, crear, eliminar, cambiar), pull requests (crear, ver, fusionar) y otras acciones generales en el repositorio.",
    "PAGESSTRUCTURE13": "Página de Testing Automático",
    "PAGESSTRUCTURE14": "Esta sección proporciona una interfaz para gestionar scripts YAML guardados y ejecutar pruebas automáticas. Ofrece una zona de ejecución donde se pueden gestionar y ejecutar scripts de prueba, así como visualizar resultados.",
    "PAGESSTRUCTURE15": "Página Testeo de TPAs",
    "PAGESSTRUCTURE16": "Esta página está dedicada a probar TPAs específicos, permitiendo la creación, edición y ejecución de pruebas de TPA. Incluye herramientas para gestionar y analizar los resultados de las pruebas.",
    "PAGESSTRUCTURE17": "Página de Configuración",
    "PAGESSTRUCTURE18": "Esta página permite configurar diversos aspectos del sistema, incluyendo la gestión de tokens para acceder a repositorios y otras configuraciones necesarias para el funcionamiento del sistema TP-Tester.",
    "PAGESSTRUCTURE19": "Este apartado proporciona un manual detallado para usuarios, permitiendo una comprensión completa y un uso eficiente del sistema TP-Tester, cubriendo desde la página de inicio hasta la configuración y ejecución de pruebas automáticas y manuales."
  },
  "JUMP_MARIUS": {
    "TITLE": "JUMP MARIUS",
    "DESCRIPTION": "Jump Marius es un emocionante juego de plataformas creado con Pygame. Únete a Marius en un emocionante viaje a través de diversos niveles llenos de desafíos, enemigos y paisajes impresionantes.",
    "VERSION": "Versión: 1.0.0",
    "RELEASE_NOTES": "Notas de la Versión:",
    "NEW_WORLDS": "Nuevos Mundos: Ahora, el editor permite guardar directamente el mundo en la carpeta correcta y antes de iniciar cada partida se puede seleccionar en qué mundo comenzar la partida, además que el editor ya contiene nuevos bloques para que crear estos mundos.",
    "CHARACTER_SELECTION": "Menú de selección de personajes: Implementado un nuevo menú que permite elegir entre 3 de los personajes que se encuentran en el juego.",
    "CHARACTER_SELECTOR_IMG": "assets/readmeContent/characterSelector.png",
    "GRAPHIC_IMPROVEMENTS": "Mejoras Gráficas: Implementación de los nuevos personajes aunque aún con bugs en la renderización de los mismos dentro de juego.",
    "NEW_TILESETS": "Nuevos Tilesets: Implementado en el editor 2 nuevos tilesets para poder crear mapas con nuevos bloques.",
    "LAUNCHER": "Launcher: Está creado el launcher que permitirá que tras loguearte se inicie el juego aunque aún no se pueden registrar usuarios y el único usuario es 'user' y la contraseña 'password.'",
    "CONFIGURATION_MENU": "Menú de Configuración: Nuevo menú de configuración que por el momento solo permite cambiar las dimensiones del juego.",
    "FINAL_BLOCK": "Bloque Final: Hasta ahora, el juego no tenía final; en esta versión, el juego se acabará al tocar un bloque llamado 'final,' creado como ejemplo o al tocar el palo de la bandera.",
    "STARTUP_SCRIPT": "Script de inicio: Añadido el ejecutable 'JumpMarius.bat' que ejecuta el juego directamente.",
    "TODO_LIST": "To-Do List:",
    "TODO_ITEMS": ["Correcto funcionamiento del launcher y todas sus funcionalidades.",
      "Implementar más niveles y desafíos.",
      "Añadir opciones de configuración avanzada.",
      "Mejorar la interfaz de usuario.",
      "Añadir al menú de configuración la opción de idioma y que el idioma se cambie automáticamente en todos los menús al cambiarlo."
    ],
    "BUGS": "Bugs:",
    "BUG_ITEMS": [
        "Mala hitbox del personaje principal.",
        "Los menús secundarios no funcionan correctamente; se queda de fondo la opción que no está marcada."
    ],
    "COLLABORATORS": "Colaboradores:",
    "COLLABORATION_DESC": "Cualquier persona puede colaborar y abrir su pull request para contribuir al desarrollo de Jump Marius. ¡Tu ayuda es bienvenida!",
    "CREDITS": "Créditos:",
    "CREDITS_ITEMS1": "Introducción a Pygame y primeras funcionalidades del juego: @DaFluffyPotato",
    "CREDITS_ITEMS2": "Nuevos tilesets: www.kenney.nl"
  },
  "CERTIFICACIONES": {
    "PRODUCCION": "Ver Página en Producción",
    "TITULO": "Proyecto de Certificaciones",
    "DESCRIPCION": "Descripción General",
    "DESCRIPCION_TEXT":"El proyecto de certificaciones es una aplicación web desarrollada con Angular 18 en el frontend y Java Spring Tools en el backend. La aplicación está diseñada para ayudar a los usuarios a prepararse para diversas certificaciones mediante la provisión de documentación teórica y exámenes de prueba.",
    "FUNCIONALIDADES": "Funcionalidades Principales",
    "REGISTRO": "Registro y Autenticación de Usuarios",
    "REGISTRO_TEXT": "Los usuarios deben registrarse y autenticarse para acceder a las funcionalidades de la aplicación.",
    "REGISTRO_TEXT2": "El sistema guarda los resultados de los exámenes en el perfil del usuario para permitir el seguimiento de su progreso.",
    "DOCUMENTACION": "Sección de Documentación",
    "DOCUMENTACION_TEXT": "Proporciona información teórica detallada sobre las certificaciones disponibles.",
    "DOCUMENTACION_TEXT2": "Los usuarios pueden estudiar el material teórico para prepararse para los exámenes.",
    "EXAMENES": "Sección de Exámenes",
    "EXAMENES_TEXT": "Permite a los usuarios realizar exámenes de prueba para las certificaciones.",
    "EXAMENES_TEXT2": "Al finalizar el examen, el sistema corrige automáticamente las respuestas.",
    "EXAMENES_TEXT3": "Proporciona explicaciones detalladas de todas las preguntas, tanto correctas como incorrectas.",
    "TECNOLOGIAS": "Tecnologías Utilizadas",
    "TECNOLOGIAS_TEXT": "Frontend",
    "TECNOLOGIAS_TEXT2": "Angular 18",
    "TECNOLOGIAS_TEXT3": "Framework de desarrollo frontend para crear interfaces de usuario dinámicas y responsivas.",
    "TECNOLOGIAS_TEXT4": "Backend",
    "TECNOLOGIAS_TEXT5": "Java Spring Tools",
    "TECNOLOGIAS_TEXT6": "Framework de desarrollo backend para crear servicios RESTful y gestionar la lógica del servidor.",
    "BBDD": "Gestión de Contenidos en Base de Datos",
    "BBDD_TEXT": "Todo el contenido de la aplicación se gestiona desde la base de datos, lo que elimina la necesidad de modificar el frontend para actualizar las certificaciones, exámenes y documentaciones disponibles. Esto incluye:",
    "BBDD_TEXT2": "Certificaciones Disponibles",
    "BBDD_TEXT3": "Las certificaciones que se pueden preparar se gestionan desde la base de datos, permitiendo agregar o modificar certificaciones sin necesidad de cambiar el frontend.",
    "BBDD_TEXT4": "Exámenes Disponibles",
    "BBDD_TEXT5": "Los exámenes se crean y gestionan en la base de datos de forma genérica, permitiendo que tanto Spring Boot como Angular los lean automáticamente sin necesidad de un nuevo despliegue.",
    "BBDD_TEXT6": "Documentaciones Disponibles",
    "BBDD_TEXT7": "La documentación teórica también se gestiona desde la base de datos, facilitando la actualización y adición de nuevos contenidos sin modificar el frontend.",
    "WORKFLOW": {
      "TITULO": "Flujo de Trabajo",
      "AUTH": {
        "TITULO": "Registro y Login",
        "1": "Los usuarios se registran proporcionando sus datos personales.",
        "2": "Los usuarios inician sesión para acceder a sus perfiles y funcionalidades de la aplicación."
      },
      "DOCS": {
        "TITULO": "Acceso a la Documentación",
        "1": "Los usuarios navegan a la sección de documentación para estudiar el material teórico.",
        "2": "La documentación está organizada por certificaciones y temas."
      },
      "EXAMS": {
        "TITULO": "Realización de Exámenes",
        "1": "Los usuarios seleccionan una certificación y realizan un examen de prueba.",
        "2": "Al finalizar, el sistema corrige el examen y muestra los resultados.",
        "3": "Los usuarios pueden revisar las explicaciones de cada pregunta para entender sus errores."
      },
      "PROGRESS": {
        "TITULO": "Seguimiento del Progreso",
        "1": "Los resultados de los exámenes se guardan en el perfil del usuario.",
        "2": "Los usuarios pueden ver su historial de exámenes y su progreso a lo largo del tiempo."
      }
    },
    "RESUME": "Este proyecto proporciona una plataforma integral para la preparación de certificaciones, combinando teoría y práctica en un solo lugar."
  },
  "GAME": {
    "TITLE": "Juego de Plataformas 2D",
    "DESCRIPTION": "Este proyecto es un juego de plataformas 2D desarrollado utilizando Angular. Está diseñado para mantener al personaje centrado en la pantalla mientras se mueve automáticamente hacia la derecha. A medida que el personaje avanza, el entorno se genera dinámicamente, con plataformas, bloques y enemigos que aparecen en posiciones aleatorias, creando una experiencia de juego en constante cambio.",
    "FEATURES": {
      "CHARACTER_MOVEMENT": {
        "TITLE": "Movimiento del Personaje",
        "DESCRIPTION": "El personaje se mueve automáticamente hacia la derecha, garantizando un progreso continuo del juego. Si el jugador presiona la tecla de flecha derecha, la velocidad del personaje aumenta, permitiendo un avance más rápido. Además, el jugador puede saltar para evitar obstáculos o alcanzar plataformas más altas."
      },
      "MAP_SCROLLING": {
        "TITLE": "Desplazamiento del Mapa",
        "DESCRIPTION": "Para mantener al personaje siempre centrado en la pantalla, el mapa se desplaza a medida que el personaje avanza. Esto significa que el entorno, incluidas las plataformas, bloques y enemigos, se mueve hacia la izquierda, dando la impresión de que el personaje está corriendo hacia adelante a través de un mundo infinito."
      },
      "DYNAMIC_GENERATION": {
        "TITLE": "Generación Dinámica de Obstáculos y Enemigos",
        "DESCRIPTION": "Uno de los aspectos clave de este juego es la generación aleatoria de elementos. Las plataformas, bloques y enemigos se generan en posiciones aleatorias a medida que el mapa avanza. Este sistema asegura que cada partida sea única, ofreciendo un desafío constante y renovado."
      },
      "COLLISION_DETECTION": {
        "TITLE": "Detección de Colisiones",
        "DESCRIPTION": "El juego cuenta con un sistema de detección de colisiones que verifica constantemente si el personaje choca con plataformas, bloques o enemigos. Si se detecta una colisión con un enemigo, se puede implementar lógica adicional, como la pérdida de una vida o el reinicio del nivel."
      },
      "GRAVITY_PHYSICS": {
        "TITLE": "Gravedad y Física del Juego",
        "DESCRIPTION": "Se ha implementado un sistema de gravedad que afecta al personaje, haciendo que caiga cuando no está sobre una plataforma o bloque. El personaje también puede saltar, y la gravedad hace que regrese al suelo tras alcanzar el punto más alto del salto."
      },
      "USER_INTERACTIVITY": {
        "TITLE": "Interactividad del Usuario",
        "DESCRIPTION": "El usuario puede controlar al personaje utilizando las teclas de flecha. La flecha derecha acelera el movimiento, la flecha izquierda permite retroceder, y la flecha arriba ejecuta un salto."
      }
    },
    "TECHNICAL_IMPLEMENTATION": {
      "TITLE": "Implementación Técnica",
      "DESCRIPTION": "El juego está construido completamente en Angular, utilizando componentes modulares para representar al personaje, enemigos, plataformas y bloques. El manejo de eventos del teclado y la lógica de movimiento se implementan utilizando listeners y funciones de actualización periódica que mantienen el estado del juego en constante cambio. El sistema de colisiones se basa en la comparación de las coordenadas del personaje con las de los objetos en el mapa, y el desplazamiento automático del mapa se logra ajustando las posiciones relativas de los objetos en cada iteración del bucle del juego."
    }
  }
}
