{
  "COMMON": {
    "CLOSE": "Cerrar"
  },
  "HEADER": {
    "SUBTITLE": "Ingeniero de Software y Desarrollador Full Stack"
  },
  "ABOUT": {
    "TITLE": "Sobre m铆",
    "INTRO": " 隆Hola! Soy Antonio Saborido Campos, tengo 23 a帽os y me considero un apasionado de la Inform谩tica, recientemente he comenzado mi carrera profesional como Desarrollador Full Stack en Babel.",
    "EDUCATION": " Mi formaci贸n acad茅mica en Ingenier铆a Inform谩tica en la Universidad de Sevilla me ha proporcionado una base s贸lida en la resoluci贸n de problemas, la programaci贸n y la gesti贸n de proyectos. Tambi茅n durante mi formaci贸n he tenido la oportunidad de aprender tecnolog铆as como Python, Node, PowerBI, Java, JavaScript, HTML, Docker, CSS y Haskell entre otras.",
    "CURRENT_ROLE": " Actualmente, tengo un contrato como Desarrollador Full Stack en Babel, donde aplico mis conocimientos en tecnolog铆as como Angular CLI en el desarrollo de aplicaciones web tanto en el front end como en back end con Spring Tools.",
    "MOTIVATION": " Mi determinaci贸n y entusiasmo por aprender y crecer en el campo de la inform谩tica me impulsan constantemente a buscar nuevas oportunidades y desaf铆os."
  },
  "EDUCATION": {
    "TITLE": "Educaci贸n",
    "TIMELINE": [
      {
        "DATE": "2024",
        "TITLE": "Certificado de Fundamentos ITIL",
        "DESCRIPTION": "Certificado de Fundamentos ITIL en Gesti贸n de Servicios de TI por PeopleCert y Axelos",
        "pdfUrl": "assets/pdfs/itil.pdf",
        "pdfName": "Certificado ITIL"
      },
      {
        "DATE": "2024",
        "TITLE": "Curso Oracle, SQL y PL/SQL",
        "DESCRIPTION": "Curso de conceptos de lenguaje de programaci贸n SQL y PL/SQL. Escritura comandos SQL, desarrollo procedimientos PL/SQL almacenados, funciones, paquetes y disparadores de base de datos.",
        "pdfUrl": "assets/pdfs/oracle.pdf",
        "pdfName": "Certificado Oracle"
      },
      {
        "DATE": "2019 - 2024",
        "TITLE": "Ingenier铆a Inform谩tica",
        "DESCRIPTION": "Universidad de Sevilla - Grado en Ingenier铆a Inform谩tica - Tecnolog铆as Inform谩ticas en la rama de sistemas de informaci贸n."
      },
      {
        "DATE": "2023",
        "TITLE": "Certificado de Nivel de Ingl茅s C1",
        "DESCRIPTION": "Certificado de nivel C1 de ingl茅s por el British Council.",
        "pdfUrl": "assets/pdfs/ingles-c1.pdf",
        "pdfName": "Certificado Ingl茅s C1"
      },
      {
        "DATE": "2017 - 2019",
        "TITLE": "Bachillerato Cient铆fico-Tecnol贸gico",
        "DESCRIPTION": "IES Sof铆a de Jerez de la Frontera."
      }
    ]
  },
  "EXPERIENCE": {
    "TITLE": "Experiencia",
    "TIMELINE": [
      {
        "DATE": "Octubre 2023 - Actualidad",
        "TITLE": "Grupo Babel",
        "DESCRIPTION": "Desarrollador FullStack - Jornada completa en remoto"
      }
    ]
  },
  "COOKIES": {
    "FOOTER": "Pol铆tica de cookies",
    "MESSAGE": "Este sitio utiliza cookies para mejorar la experiencia de usuario. 驴Aceptas nuestra pol铆tica de cookies?",
    "DECLINE": "Rechazar",
    "ACCEPT": "Aceptar",
    "READ": "Leer la pol铆tica de cookies"
  },
  "COOKIESPAGE": {
    "TITLE": "Pol铆tica de cookies",
    "POLICY_DESC": "Esta es la pol铆tica de cookies de nuestra aplicaci贸n, donde explicamos detalladamente c贸mo utilizamos las cookies para mejorar tu experiencia de usuario. Las cookies son peque帽os archivos de texto que se almacenan en tu dispositivo para recordar tus preferencias y realizar un seguimiento de tu comportamiento de navegaci贸n, lo que nos permite ofrecerte una experiencia m谩s personalizada y eficiente. Utilizamos tanto cookies propias como de terceros para recopilar datos anal铆ticos, personalizar el contenido, y mejorar la funcionalidad de nuestro sitio. Al continuar navegando en nuestro sitio, aceptas el uso de estas cookies conforme a nuestra pol铆tica.",    "PRIVACY_TITLE": "Pol铆tica de Privacidad",
    "INTRODUCTION_TITLE": "Introducci贸n",
    "INTRODUCTION_DESC": "En antoniosaborido.es, valoramos tu privacidad y nos comprometemos a proteger la informaci贸n personal que compartes con nosotros. Esta Pol铆tica de Privacidad describe c贸mo recopilamos, usamos y protegemos tu informaci贸n personal cuando visitas nuestra p谩gina web.",
    "COLLECTION_TITLE": "Informaci贸n que Recopilamos",
    "PERSONAL_INFO_DESC": "Informaci贸n Personal: Podemos recopilar informaci贸n personal que nos proporcionas voluntariamente, como tu nombre, direcci贸n de correo electr贸nico, y cualquier otro dato que nos env铆es a trav茅s de formularios de contacto o suscripciones a boletines.",
    "NON_PERSONAL_INFO_DESC": "Informaci贸n No Personal: Podemos recopilar informaci贸n no personal sobre tu visita a nuestra p谩gina web, como tu direcci贸n IP, tipo de navegador, p谩ginas visitadas, y tiempo de permanencia en nuestra web. Esta informaci贸n se recopila de manera an贸nima y se utiliza para mejorar la experiencia del usuario.",
    "USAGE_TITLE": "Uso de la Informaci贸n",
    "USAGE_DESC": "Utilizamos la informaci贸n recopilada para los siguientes prop贸sitos:",
    "COMMUNICATION": "Comunicaci贸n: Para responder a tus consultas, comentarios o solicitudes.",
    "WEBSITE_IMPROVEMENT": "Mejora del Sitio Web: Para analizar el uso de nuestra web y mejorar su funcionalidad y contenido.",
    "MARKETING": "Marketing: Para enviarte informaci贸n sobre actualizaciones, promociones y noticias relacionadas con nuestro sitio web, siempre y cuando hayas dado tu consentimiento para recibir estas comunicaciones.",
    "COOKIES_TITLE": "Cookies",
    "COOKIES_DESC": "Utilizamos cookies para mejorar tu experiencia en nuestro sitio web. Las cookies son peque帽os archivos de texto que se almacenan en tu dispositivo cuando visitas ciertas p谩ginas web. Puedes desactivar las cookies cambiando la configuraci贸n de tu navegador, pero esto puede afectar la funcionalidad del sitio.",
    "SHARING_TITLE": "Compartir Informaci贸n",
    "SHARING_DESC": "No vendemos, intercambiamos ni transferimos tu informaci贸n personal a terceros. Sin embargo, podemos compartir tu informaci贸n con proveedores de servicios de confianza que nos ayudan a operar nuestro sitio web, siempre que estas partes acuerden mantener esta informaci贸n confidencial.",
    "SECURITY_TITLE": "Seguridad de la Informaci贸n",
    "SECURITY_DESC": "Implementamos diversas medidas de seguridad para proteger tu informaci贸n personal. Sin embargo, ten en cuenta que ning煤n m茅todo de transmisi贸n por Internet o de almacenamiento electr贸nico es 100% seguro.",
    "LINKS_TITLE": "Enlaces a Otros Sitios Web",
    "LINKS_DESC": "Nuestra p谩gina web puede contener enlaces a otros sitios web de inter茅s. Sin embargo, una vez que hayas utilizado estos enlaces para salir de nuestra web, no tenemos control sobre esos otros sitios. Por lo tanto, no podemos responsabilizarnos de la protecci贸n y privacidad de cualquier informaci贸n que proporciones mientras visitas dichos sitios.",
    "RIGHTS_TITLE": "Tus Derechos",
    "RIGHTS_DESC": "Tienes derecho a acceder, rectificar o eliminar tu informaci贸n personal que hemos recopilado. Si deseas ejercer estos derechos, por favor cont谩ctanos a trav茅s de la informaci贸n proporcionada en nuestro sitio web.",
    "PRIVACY_CHANGES_TITLE": "Cambios en la Pol铆tica de Privacidad",
    "PRIVACY_CHANGES_DESC": "Podemos actualizar esta Pol铆tica de Privacidad de vez en cuando. Te notificaremos sobre cualquier cambio publicando la nueva pol铆tica en esta p谩gina. Te recomendamos revisar esta pol铆tica peri贸dicamente para estar al tanto de cualquier modificaci贸n."
  },
  "PROJECTS": {
    "TITLE": "Proyectos",
    "1": "Back",
    "2": "Search",
    "3": "Search..."
  }
}
